## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_hostname_tls_setting.c4_tls will be created
  + resource "cloudflare_hostname_tls_setting" "c4_tls" {
      + created_at = (known after apply)
      + hostname   = "c4.akatsuki.gg"
      + id         = (known after apply)
      + setting    = "min_tls_version"
      + updated_at = (known after apply)
      + value      = "1.0"
      + zone_id    = "18875b98b47e13a11f76f5795912453f"
    }

  # cloudflare_hostname_tls_setting.c_tls will be created
  + resource "cloudflare_hostname_tls_setting" "c_tls" {
      + created_at = (known after apply)
      + hostname   = "c.akatsuki.gg"
      + id         = (known after apply)
      + setting    = "min_tls_version"
      + updated_at = (known after apply)
      + value      = "1.0"
      + zone_id    = "18875b98b47e13a11f76f5795912453f"
    }

  # cloudflare_hostname_tls_setting.ce_tls will be created
  + resource "cloudflare_hostname_tls_setting" "ce_tls" {
      + created_at = (known after apply)
      + hostname   = "ce.akatsuki.gg"
      + id         = (known after apply)
      + setting    = "min_tls_version"
      + updated_at = (known after apply)
      + value      = "1.0"
      + zone_id    = "18875b98b47e13a11f76f5795912453f"
    }

  # cloudflare_hostname_tls_setting.osu_tls will be created
  + resource "cloudflare_hostname_tls_setting" "osu_tls" {
      + created_at = (known after apply)
      + hostname   = "osu.akatsuki.gg"
      + id         = (known after apply)
      + setting    = "min_tls_version"
      + updated_at = (known after apply)
      + value      = "1.0"
      + zone_id    = "18875b98b47e13a11f76f5795912453f"
    }

  # cloudflare_zone_settings_override.tls_settings will be created
  + resource "cloudflare_zone_settings_override" "tls_settings" {
      + id                       = (known after apply)
      + initial_settings         = (known after apply)
      + initial_settings_read_at = (known after apply)
      + readonly_settings        = (known after apply)
      + zone_id                  = "18875b98b47e13a11f76f5795912453f"
      + zone_status              = (known after apply)
      + zone_type                = (known after apply)

      + settings {
          + always_online               = (known after apply)
          + always_use_https            = (known after apply)
          + automatic_https_rewrites    = (known after apply)
          + binary_ast                  = (known after apply)
          + brotli                      = (known after apply)
          + browser_cache_ttl           = (known after apply)
          + browser_check               = (known after apply)
          + cache_level                 = (known after apply)
          + challenge_ttl               = (known after apply)
          + ciphers                     = (known after apply)
          + cname_flattening            = (known after apply)
          + development_mode            = (known after apply)
          + early_hints                 = (known after apply)
          + email_obfuscation           = (known after apply)
          + filter_logs_to_cloudflare   = (known after apply)
          + fonts                       = (known after apply)
          + h2_prioritization           = (known after apply)
          + hotlink_protection          = (known after apply)
          + http2                       = (known after apply)
          + http3                       = (known after apply)
          + image_resizing              = (known after apply)
          + ip_geolocation              = (known after apply)
          + ipv6                        = (known after apply)
          + log_to_cloudflare           = (known after apply)
          + max_upload                  = (known after apply)
          + min_tls_version             = "1.2"
          + mirage                      = (known after apply)
          + opportunistic_encryption    = (known after apply)
          + opportunistic_onion         = (known after apply)
          + orange_to_orange            = (known after apply)
          + origin_error_page_pass_thru = (known after apply)
          + origin_max_http_version     = (known after apply)
          + polish                      = (known after apply)
          + prefetch_preload            = (known after apply)
          + privacy_pass                = (known after apply)
          + proxy_read_timeout          = (known after apply)
          + pseudo_ipv4                 = (known after apply)
          + replace_insecure_js         = (known after apply)
          + response_buffering          = (known after apply)
          + rocket_loader               = (known after apply)
          + security_level              = (known after apply)
          + server_side_exclude         = (known after apply)
          + sort_query_string_for_cache = (known after apply)
          + speed_brain                 = (known after apply)
          + ssl                         = (known after apply)
          + ssl_automatic_mode          = (known after apply)
          + tls_1_2_only                = (known after apply)
          + tls_1_3                     = (known after apply)
          + tls_client_auth             = (known after apply)
          + true_client_ip_header       = (known after apply)
          + universal_ssl               = (known after apply)
          + visitor_ip                  = (known after apply)
          + waf                         = (known after apply)
          + webp                        = (known after apply)
          + websockets                  = (known after apply)
          + zero_rtt                    = (known after apply)

          + aegis (known after apply)

          + minify (known after apply)

          + mobile_redirect (known after apply)

          + nel (known after apply)

          + security_header (known after apply)
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```
</details>